Конфигурация/Documents/КонвертацияЦенныхБумаг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>КонвертацияЦенныхБумаг</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.БухгалтерскийУчет</xr:Item>
				<xr:Item>InformationRegister.ОперацииСЦеннымиБумагами</xr:Item>
				<xr:Item>AccountingRegister.ЕдиныйБухгалтерскийУчет</xr:Item>
				<xr:Item>AccumulationRegister.БухПартииЦенныхБумаг</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиЦенныхБумаг</xr:Item>
				<xr:Item>AccountingRegister.НалоговыйУчет</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидКонвертации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонвертацииЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>10</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеннаяБумагаНовая</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Векселя</v8:Type>
						<v8:Type>cfg:CatalogRef.Облигации</v8:Type>
						<v8:Type>cfg:CatalogRef.Паи</v8:Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЦенныеБумаги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДепозитарныйСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоНовое</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаПартии</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/InformationRegisters/ОперацииСЦеннымиБумагами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ОперацииСЦеннымиБумагами</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаПокупки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставкиПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплатыПлановая</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОплаты</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаПроцент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦенаПроцент</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаКупона</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОперации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтрокаПартии</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.СтрокаПартии</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыводЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеРешенияОбИзмененииУставногоКапиталаООО</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыбытиеСтоимостиЦенныхБумагПоБухгалтерскомуУчету</v8:Type>
						<v8:Type>cfg:DocumentRef.РеклассификацияАктивовЕПС</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоставкаЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.СнятиеЦеннойБумагиСУчета</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеСписаниеРезервов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.ИзменениеУсловийСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаСделки</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.ВводЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЧастьСделкиРЕПО</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДвижения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвижений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПогашениеКупона</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеЦенныхБумаг</v8:Type>
						<v8:Type>cfg:DocumentRef.СделкаРЕПО</v8:Type>
						<v8:Type>cfg:DocumentRef.ПогашениеЦеннойБумаги</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеДивидендов</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсполнениеОбязательствПоСделке</v8:Type>
						<v8:Type>cfg:DocumentRef.Маржа</v8:Type>
						<v8:Type>cfg:DocumentRef.Сделка</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоручениеНаДвижениеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рынок</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РынкиЦенныхБумаг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЦеннаяБумага</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумаги</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация/Documents/КонвертацияЦенныхБумаг/Ext/ObjectModule.bsl
Процедура УстановитьБлокировки()
	
	Если МонопольныйРежим() Тогда
		Возврат;
	КонецЕсли;
	
	БлокировкаДанных = Новый БлокировкаДанных;
	
	// остатки ценных бумаг
	ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("РегистрНакопления.ОстаткиЦенныхБумаг");
	
	ЭлементБлокировкиДанных.УстановитьЗначение("Организация",                  ЭтотОбъект.Организация);
	ЭлементБлокировкиДанных.УстановитьЗначение("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	ЭлементБлокировкиДанных.УстановитьЗначение("Рынок",                        ЭтотОбъект.Рынок);
	ЭлементБлокировкиДанных.УстановитьЗначение("ЦеннаяБумага",                 ЭтотОбъект.ЦеннаяБумага);
	
	ЭлементБлокировкиДанных.ИсточникДанных = ЭтотОбъект.ЦенныеБумаги;
	ЭлементБлокировкиДанных.ИспользоватьИзИсточникаДанных("ДепозитарныйСчет", "ДепозитарныйСчет");

	БлокировкаДанных.Заблокировать();
	
КонецПроцедуры // УстановитьБлокировки

Процедура ПроведениеПоРегистрамБэкОфиса(Отказ) Экспорт
	
	УстановитьБлокировки();
	
	// новая схема проведения
	РаботаСРегистрамиНакопления.ОчиститьДвиженияПоБэкофису(ЭтотОбъект);
	
	Движения.ОстаткиЦенныхБумаг.Записывать = Истина;
	Движения.ОперацииСЦеннымиБумагами.Записывать         = Истина;

	// остатки ценных бумаг
	
	Для каждого СтрокаЦенныеБумаги Из ЭтотОбъект.ЦенныеБумаги Цикл
		Если ЭтотОбъект.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.Обмен Тогда
			// списываем остатки ц/б
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьРасход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумага;
			Движение.Количество                   = СтрокаЦенныеБумаги.Количество;
						
			// приходуем остатки новой ц/б
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумагаНовая;
			Движение.Количество                   = СтрокаЦенныеБумаги.КоличествоНовое;
						
		ИначеЕсли ЭтотОбъект.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.ОбменЦелогоКоличества Тогда 
			// списываем остатки ц/б
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьРасход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумага;
			Движение.Количество                   = Цел(СтрокаЦенныеБумаги.КоличествоНовое / ЭтотОбъект.Коэффициент);
						
			// приходуем остатки новой ц/б
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумагаНовая;
			Движение.Количество                   = СтрокаЦенныеБумаги.КоличествоНовое;
						
		ИначеЕсли ЭтотОбъект.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.Выделение Тогда
			// приходуем остатки новой ц/б
			Движение = Движения.ОстаткиЦенныхБумаг.ДобавитьПриход();
			Движение.Период                       = ЭтотОбъект.Дата;
			Движение.Организация                  = ЭтотОбъект.Организация;
			Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
			Движение.ДепозитарныйСчет             = СтрокаЦенныеБумаги.ДепозитарныйСчет;
			Движение.Рынок                        = ЭтотОбъект.Рынок;
			Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумагаНовая;
			Движение.Количество                   = СтрокаЦенныеБумаги.КоличествоНовое;
						
		КонецЕсли;
		
	КонецЦикла;
	
	// операции с ценными бумгами
	// счет депо не нужен
	ИтогоКоличество      = ЭтотОбъект.ЦенныеБумаги.Итог("Количество");
	ИтогоКоличествоНовое = ЭтотОбъект.ЦенныеБумаги.Итог("КоличествоНовое");
	
	Если ЭтотОбъект.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.Обмен Тогда
		
		// списываем остатки ц/б			
		Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
		Движение.Операция 					  = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения 				  = Перечисления.ВидыДвижений.Расход;
		Движение.Организация 				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумага;
		Движение.Количество 				  = ИтогоКоличество;
		Движение.ДатаОперации 				  = ЭтотОбъект.Дата;
		
		// приходуем остатки новой ц/б
		Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
		Движение.Операция 					  = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения 				  = Перечисления.ВидыДвижений.Приход;
		Движение.Организация 				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумагаНовая;
		Движение.Количество 				  = ИтогоКоличествоНовое;
		Движение.ДатаОперации 				  = ЭтотОбъект.Дата;
		Движение.ДатаПокупки                  = ЭтотОбъект.Дата;
		
	ИначеЕсли ЭтотОбъект.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.ОбменЦелогоКоличества Тогда 
		
		// списываем остатки ц/б
		Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
		Движение.Операция 					  = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения 				  = Перечисления.ВидыДвижений.Расход;
		Движение.Организация 				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумага;
		Движение.Количество 				  = Цел(ИтогоКоличествоНовое / ЭтотОбъект.Коэффициент);
		Движение.ДатаОперации 				  = ЭтотОбъект.Дата;
		
		// приходуем остатки новой ц/б			
		Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
		Движение.Операция 					  = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения 				  = Перечисления.ВидыДвижений.Приход;
		Движение.Организация 				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумагаНовая;
		Движение.Количество 				  = ИтогоКоличествоНовое;
		Движение.ДатаОперации 				  = ЭтотОбъект.Дата;
		Движение.ДатаПокупки                  = ЭтотОбъект.Дата;
		
	ИначеЕсли ЭтотОбъект.ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.Выделение Тогда
		
		// приходуем остатки новой ц/б			
		Движение = Движения.ОперацииСЦеннымиБумагами.Добавить();
		Движение.Операция 					  = ЭтотОбъект.Ссылка;
		Движение.ВидДвижения 				  = Перечисления.ВидыДвижений.Приход;
		Движение.Организация 				  = ЭтотОбъект.Организация;
		Движение.СчетДоверительногоУправления = ЭтотОбъект.СчетДоверительногоУправления;
		Движение.Рынок                        = ЭтотОбъект.Рынок;
		Движение.ЦеннаяБумага                 = ЭтотОбъект.ЦеннаяБумагаНовая;
		Движение.Количество 				  = ИтогоКоличествоНовое;
		Движение.ДатаОперации 				  = ЭтотОбъект.Дата;
		Движение.ДатаПокупки                  = ЭтотОбъект.Дата;
		
	КонецЕсли;		
	
	Движения.Записать();
	
	// проверим отриц. остатки
	РаботаСРегистрамиНакопления.ПроверитьОтрицательныеОстаткиЦенныхБумаг(ЭтотОбъект, Отказ);
	
КонецПроцедуры // ПроведениеПоРегистрамБэкОфиса

Процедура ПроведениеПоРегиструЕПС(УчетныйРегистр, Отказ) Экспорт
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Конвертация ценных бумаг, процедура проведения по ЕПС не реализована");
	Возврат;
	
КонецПроцедуры 

Процедура ПроведениеПоРегиструБухгалтерии(УчетныйРегистр, Отказ) Экспорт
	
	Если Рынок <> Перечисления.РынкиЦенныхБумаг.Акции Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Конвертация ценных бумаг, процедура проведения реализована только для акций");
		Возврат;
	КонецЕсли;	
	
	Если ВидКонвертации = Справочники.ВидыКонвертацииЦенныхБумаг.Выделение Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для вида конвертации 'Выделение' процедура проведения не реализована");
		Возврат;		
	КонецЕсли;	
	
	Движения[УчетныйРегистр].Записывать = Истина;
		
	ВидСубконтоУчетаЦеннойБумаги = БухгалтерскийУчет.ОпределитьВидСубконтоУчетаЦеннойБумаги(ЭтотОбъект.Рынок);	
		
	СчетРасчетов = ПланыСчетов.Основной.РасчетыСКонтрагентами; //76.52
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БухПартииЦенныхБумаг.СтрокаКорзиныЦенныхБумаг КАК СтрокаКорзиныЦенныхБумаг,
	|	БухПартииЦенныхБумаг.ЦеннаяБумага КАК ЦеннаяБумага,
	|	БухПартииЦенныхБумаг.ВидДвижения КАК ВидДвижения,
	|	СУММА(БухПартииЦенныхБумаг.Количество) КАК Количество,
	|	СУММА(БухПартииЦенныхБумаг.Стоимость) КАК Стоимость,
	|	СУММА(БухПартииЦенныхБумаг.Переоценка) КАК Переоценка,
	|	СУММА(БухПартииЦенныхБумаг.СтоимостьПокупки) КАК СтоимостьПокупки,
	|	СУММА(БухПартииЦенныхБумаг.РасходыПриПокупкеВСтоимости) КАК РасходыПриПокупкеВСтоимости,
	|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВСтоимости) КАК ПереоценкаВСтоимости,
	|	СУММА(БухПартииЦенныхБумаг.СтоимостьВВалютеУчета) КАК СтоимостьВВалютеУчета,
	|	СУММА(БухПартииЦенныхБумаг.ПереоценкаВВалютеУчета) КАК ПереоценкаВВалютеУчета,
	|	БухПартииЦенныхБумаг.Рынок КАК Рынок
	|ИЗ
	|	РегистрНакопления.БухПартииЦенныхБумаг КАК БухПартииЦенныхБумаг
	|ГДЕ
	|	БухПартииЦенныхБумаг.Регистратор = &Регистратор
	|	И БухПартииЦенныхБумаг.ВидУчета = &ВидУчета
	|
	|СГРУППИРОВАТЬ ПО
	|	БухПартииЦенныхБумаг.СтрокаКорзиныЦенныхБумаг,
	|	БухПартииЦенныхБумаг.ЦеннаяБумага,
	|	БухПартииЦенныхБумаг.ВидДвижения,
	|	БухПартииЦенныхБумаг.Рынок";
	
	Запрос.УстановитьПараметр("Регистратор", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ВидУчета",    Перечисления.ВидыУчета[УчетныйРегистр]);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ЦеннаяБумага = Выборка.ЦеннаяБумага;
		
		Если ТипЗнч(ЦеннаяБумага) = Тип("СправочникСсылка.Паи") Тогда
			Валюта = ЭтотОбъект.Организация.ВалютаУчета;
		Иначе
			Валюта = ЦеннаяБумага.ВалютаНоминала;
		КонецЕсли;

		УчетныйАктив       = БухгалтерскийУчет.ОпределитьУчетныйАктив(ЭтотОбъект.Дата, ЭтотОбъект.Рынок, ЦеннаяБумага);

		НастройкиУчетаАктива = БухгалтерскийУчет.ОпределитьНастройкиУчетаАктива(
			ЭтотОбъект.Дата,
			ЭтотОбъект.Организация,
			ЭтотОбъект.СчетДоверительногоУправления,
			УчетныйАктив,
			УчетныйРегистр);	
						
		ВалютныйУчет = НастройкиУчетаАктива.СчетУчета.Валютный;

			
		Если Выборка.ВидДвижения = ВидДвиженияНакопления.Расход Тогда 	
			
			Контрагент = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЦеннаяБумага, ЭтотОбъект.Дата);
			
			// ТЕЛО
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.СтоимостьВВалютеУчета, "Списание ценной бумаги по конвертации");
			
			// дебет
			Проводка.СчетДт = СчетРасчетов;			
			Проводка.СубконтоДт.Контрагенты = Контрагент;
			
			// кредит
			Проводка.СчетКт = НастройкиУчетаАктива.СчетУчета;
			Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
			
			Проводка.КоличествоКт = Выборка.Количество;
			
			Если ВалютныйУчет Тогда
				Проводка.ВалютнаяСуммаКт = Выборка.Стоимость;
				Проводка.ВалютаКт = Валюта;
			КонецЕсли;
			
			
			Если Выборка.ПереоценкаВВалютеУчета <> 0 Тогда
			
				//ПЕРЕОЦЕНКА
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.ПереоценкаВВалютеУчета, "Списание переоценки ценной бумаги по конвертации");
				
				// дебет
				Проводка.СчетДт = СчетРасчетов;
				Проводка.СубконтоДт.Контрагенты = Контрагент;

				// кредит		
				Проводка.СчетКт = НастройкиУчетаАктива.СчетУчетаПереоценки;
				Проводка.СубконтоКт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;
				
				Если ВалютныйУчет Тогда
					Проводка.ВалютнаяСуммаКт = Выборка.Переоценка;
					Проводка.ВалютаКт = Валюта;
				КонецЕсли;
			
			КонецЕсли;
			
		ИначеЕсли Выборка.ВидДвижения = ВидДвиженияНакопления.Приход Тогда 
			
			Контрагент = РаботаСЦеннымиБумагами.КонтрагентПоЦеннойБумаге(ЦеннаяБумага, ЭтотОбъект.Дата);
			
			// ТЕЛО
			Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.СтоимостьВВалютеУчета, "Приход ценной бумаги по конвертации");
			
			// дебет
			Проводка.СчетДт = НастройкиУчетаАктива.СчетУчета;
			Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;		
			Проводка.КоличествоДт = Выборка.Количество;
			
			// кредит
			Проводка.СчетКт = СчетРасчетов;			
			Проводка.СубконтоКт.Контрагенты = Контрагент;
						
			Если ВалютныйУчет Тогда
				Проводка.ВалютнаяСуммаКт = Выборка.Стоимость;
				Проводка.ВалютаКт = Валюта;
			КонецЕсли;
			
			Если Выборка.ПереоценкаВВалютеУчета <> 0 Тогда
			
				//ПЕРЕОЦЕНКА
				Проводка = РаботаСРегистрамиБухгалтерии.ДобавитьПроводку(ЭтотОбъект, Движения[УчетныйРегистр], Выборка.ПереоценкаВВалютеУчета, "Приход ценной бумаги по конвертации");
				
				// дебет
				Проводка.СчетДт = НастройкиУчетаАктива.СчетУчетаПереоценки;
				Проводка.СубконтоДт[ВидСубконтоУчетаЦеннойБумаги] = ЦеннаяБумага;		
				
				// кредит
				Проводка.СчетКт = СчетРасчетов;			
				Проводка.СубконтоКт.Контрагенты = Контрагент;
							
				Если ВалютныйУчет Тогда
					Проводка.ВалютнаяСуммаКт = Выборка.Переоценка;
					Проводка.ВалютаКт = Валюта;
				КонецЕсли;
				
			КонецЕсли;
			
 		КонецЕсли;
	КонецЦикла;	
		
КонецПроцедуры	

#Область ОБРАБОТЧИКИ_СОБЫТИЙ

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЭтотОбъект.Рынок = Перечисления.РынкиЦенныхБумаг.Акции;
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры // ОбработкаЗаполнения

Процедура ПриКопировании(ОбъектКопирования)
	
	УниверсальныеМеханизмы.ЗаполнитьОбщиеРеквизитыДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	УниверсальныеМеханизмы.ПослеОбработкиПроверкиЗаполнения(ЭтотОбъект, Отказ);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// предварительная обработка объекта
	РаботаСДокументами.ПередЗаписью(ЭтотОбъект);

	// блокирующие проверки
	Если Не УниверсальныеМеханизмы.ОбъектМожноЗаписать(ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения) Тогда
		Возврат;
	КонецЕсли;	
	
	Если РаботаСДокументами.ЭтоРежимПроведения(ЭтотОбъект, РежимЗаписи) Тогда
		
		// на текущий момент документ поддерживает только конвертацию акций
		Если ЭтотОбъект.Рынок <> Перечисления.РынкиЦенныхБумаг.Акции Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Поддерживается только конвертация акций.", ЭтотОбъект, "Рынок",, Отказ);
			Возврат;
		КонецЕсли;
		
		// тип ц/б должен соответствовать рынку ц/б
		ТребТипЦеннойБумаги = РаботаСЦеннымиБумагамиКлиентСервер.ТипЦеннойБумагиВЗависимостиОтРынка(ЭтотОбъект.Рынок);
		
		Если Не ТребТипЦеннойБумаги.СодержитТип(ТипЗнч(ЭтотОбъект.ЦеннаяБумага)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип ц/б " + ТипЗнч(ЭтотОбъект.ЦеннаяБумага) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".", ЭтотОбъект, "ЦеннаяБумага",, Отказ);
		КонецЕсли;
		
		Если Не ТребТипЦеннойБумаги.СодержитТип(ТипЗнч(ЭтотОбъект.ЦеннаяБумагаНовая)) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Тип новой ц/б " + ТипЗнч(ЭтотОбъект.ЦеннаяБумагаНовая) + " не соответствует рынку " + ЭтотОбъект.Рынок + ".", ЭтотОбъект, "ЦеннаяБумагаНовая",, Отказ);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	РаботаСЖурналамиОпераций.ПриЗаписиДокумента(ЭтотОбъект);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	РаботаСДокументами.СформироватьДвиженияПоРегистрамБэкОфиса(ЭтотОбъект, Отказ);
	
	РаботаСДокументами.СформироватьПроводки(ЭтотОбъект, Отказ);
	
КонецПроцедуры

#КонецОбласти
